{
    "employers": [
        {
            "end_date": null,
            "location": "Cincinnati, OH",
            "name": "84.51˚",
            "roles": [
                {
                    "description": null,
                    "end_date": null,
                    "notes": [
                        {
                            "summary": "Developed a Svelte-based chat app allowing users to learn about generative AI by using various LLMs in a responsible and ethical way.",
                            "is_enabled": true
                        }
                    ],
                    "start_date": "2024-08-01",
                    "title": "Lead Frontend Engineer"
                },
                {
                    "description": null,
                    "end_date": "2024-08-01",
                    "notes": [
                        {
                            "summary": "Designed and implemented standardized CI/CD workflows using TeamCity and GitHub Actions, integrating security tools and Docker images, and led the migration to GitHub Enterprise Cloud.",
                            "is_enabled": true
                        },
                        {
                            "summary": "Developed standardized CI tooling with TeamCity templates to optimize development workflows for Java and Python teams.",
                            "is_enabled": false
                        },
                        {
                            "summary": "Enhanced CI/CD pipelines by incorporating JFrog Xray and SonarQube into TeamCity, improving early awareness of security and quality concerns.",
                            "is_enabled": false
                        },
                        {
                            "summary": "Developed a standardized set of enterprise-ready Docker images to streamline certificate installations and environment configurations for development teams.",
                            "is_enabled": false
                        },
                        {
                            "summary": "Automated the migration of all repositories from GitHub Enterprise Server to GitHub Enterprise Cloud, ensuring smooth communication and support throughout the process.",
                            "is_enabled": false
                        },
                        {
                            "summary": "Configured CI/CD pipelines using GitHub Actions and Reusable Workflows to standardize development practices.",
                            "is_enabled": false
                        },
                        {
                            "summary": "Contributed to on-prem to cloud migration efforts, working alongside a team of bootcamp contractors to accelerate the process.",
                            "is_enabled": false
                        }
                    ],
                    "start_date": "2019-09-01",
                    "title": "DevOps Engineer"
                },
                {
                    "description": null,
                    "end_date": "2019-09-01",
                    "notes": [
                        {
                            "summary": "Contributed to building a cloud-based data science platform's web interface with Angular, integrating Google Cloud Platform services.",
                            "is_enabled": true
                        },
                        {
                            "summary": "Enhanced UI components and developed new features by collaborating with architects, product designers, and data scientists to meet customer needs.",
                            "is_enabled": true
                        },
                        {
                            "summary": "Contributed to the development of a a Python-based API for provisioning compute resources in Google Kubernetes Engine (GKE), ensuring scalable resource management.",
                            "is_enabled": false
                        }
                    ],
                    "start_date": "2018-03-01",
                    "title": "Lead Software Engineer"
                },
                {
                    "description": null,
                    "end_date": "2018-03-01",
                    "notes": [
                        {
                            "summary": "Built a cross-platform application with Android, Electron, and Angular, providing busy families with tools for staying connected around meal planning.",
                            "is_enabled": true
                        },
                        {
                            "summary": "Created a Unity 3D experience demonstrating how Category Managers could leverage VR for remote strategic decision-making across different locations.",
                            "is_enabled": true
                        },
                        {
                            "summary": "Built a Unity 3D and HoloLens application demonstrating how mixed reality can enrich the in-store walk-through process with deeper data integration.",
                            "is_enabled": true
                        },
                        {
                            "summary": "Developed an Android application showcasing the potential of AR and shopper data to enhance and personalize existing print experiences.",
                            "is_enabled": true
                        }
                    ],
                    "start_date": "2015-07-20",
                    "title": "Senior UI Developer"
                }
            ],
            "start_date": "2015-07-20"
        },
        {
            "end_date": "2014-12-01",
            "location": "Cincinnati, OH",
            "name": "Deca Interactive",
            "roles": [
                {
                    "description": null,
                    "end_date": "2014-12-01",
                    "notes": [
                        {
                            "summary": "Developed a feature-rich Android app for the Bunbury and Buckle Up Music Festivals, improving event accessibility and attendee experience.",
                            "is_enabled": true
                        }
                    ],
                    "start_date": "2014-04-01",
                    "title": "Android Developer"
                }
            ],
            "start_date": "2014-04-01"
        },
        {
            "end_date": "2015-20-07",
            "location": "Cincinnati, OH",
            "name": "Cardinal Solutions Group",
            "roles": [
                {
                    "description": null,
                    "end_date": "2015-07-20",
                    "notes": [
                        {
                            "summary": "Assisted in the configuration of an off-the-shelf application using the Gosu JVM-based language and IntelliJ IDEA, focused on managing lines of business for insurance companies.",
                            "is_enabled": false
                        },
                        {
                            "summary": "Built a Java CLI tool for efficient handling of custom messaging protocols, enhancing data exchange between business and banking systems.",
                            "is_enabled": true
                        },
                        {
                            "summary": "Partnered with the internal design team to develop an iPad app that showcased key projects and highlighted company capabilities.",
                            "is_enabled": true
                        },
                        {
                            "summary": "Developed an iPad application backed by SharePoint Lists to catalog sales resources and technical specifications for a window and door company.",
                            "is_enabled": false
                        },
                        {
                            "summary": "Conducted a one-week training course on core Object-Oriented Programming (OOP) and Java language fundamentals.",
                            "is_enabled": false
                        }
                    ],
                    "start_date": "2013-01-01",
                    "title": "Java/Mobile Consultant"
                }
            ],
            "start_date": "2013-01-01"
        },
        {
            "end_date": "2013-01-01",
            "location": "Highland Heights, KY",
            "name": "Center for Applied Informatics",
            "roles": [
                {
                    "description": null,
                    "end_date": "2013-01-01",
                    "notes": [
                        {
                            "summary": "Developed Android apps for the Kentucky Department of Education, providing essential alerts and information to teachers and technologists.",
                            "is_enabled": true
                        }
                    ],
                    "start_date": "2011-03-01",
                    "title": "Android Developer"
                }
            ],
            "start_date": "2011-03-01"
        }
    ]
}
